// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let x = 5;
if (x !== 0) {
    console.log('Вірно');
} else {
    console.log('Не вірно');
}

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = 45;
if (time >= 0 && time <= 15) {
    console.log('Перша частина години');
} else if (time > 15 && time <= 30) {
    console.log('Друга частина години');
} else if (time > 30 && time <= 45) {
    console.log('Третя частина години');
} else if (time > 45 && time <= 59) {
    console.log('Четверта частина години');
} else {
    console.log('Error')
}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю)

let day = 5;
if (day > 0 && day <= 10) {
    console.log('Перша декада');
} else if (day > 10 && day <= 20) {
    console.log('Друга декада');
} else if (day > 20 && day <= 31) {
    console.log('Третя декада');
} else {
    console.log('Error')
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
 switch (+prompt("Weekday")) {
     case 1:
         console.log('Почати вчити програмування');
         break;
     case 2:
         console.log('Знайти курси');
         break;
     case 3:
         console.log('Вивчити HTMl');
         break;
     case 4:
         console.log('Вивчити CSS');
         break;
     case 5:
         console.log('Вивчити JavaScript');
         break;
     case 6:
         console.log('Вивчити React');
         break;
     case 7:
         console.log('Піти на роботу');
         break;
 }

// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
let num1 = 5;
let num2 = 12;
if (num1 > num2) {
    console.log(num1)
} else if (num2 > num1) {
    console.log(num2)
} else {
    console.log('Equal numbers')
}







// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
let xX = 0 || 'default';
console.log(xX)



